Белгипрозем_2017/src/InformationRegisters/мАктуальныеВидыРаботЮрЛиц/мАктуальныеВидыРаботЮрЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мАктуальныеВидыРаботЮрЛиц</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРаботЮрЛиц</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/мАктуальныеВидыРаботЮрЛиц/Forms/ФормаСоздания/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь; 
	Иначе
		Пользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли; 
	
	ЗаполнитьСписок();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мАктуальныеВидыРаботЮрЛиц.ВидРаботЮрЛиц КАК ВидРаботы
		|ПОМЕСТИТЬ Актуальные
		|ИЗ
		|	РегистрСведений.мАктуальныеВидыРаботЮрЛиц КАК мАктуальныеВидыРаботЮрЛиц
		|ГДЕ
		|	мАктуальныеВидыРаботЮрЛиц.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мВидыРаботЮрЛица.Ссылка КАК ВидРабот,
		|	ВЫБОР
		|		КОГДА мВидыРаботЮрЛица.Ссылка В (Актуальные.ВидРаботы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Выбран
		|ИЗ
		|	Справочник.мВидыРаботЮрЛица КАК мВидыРаботЮрЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Актуальные КАК Актуальные
		|		ПО мВидыРаботЮрЛица.Ссылка = Актуальные.ВидРаботы
		|ГДЕ
		|	НЕ мВидыРаботЮрЛица.ПометкаУдаления
		|	И НЕ мВидыРаботЮрЛица.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	мВидыРаботЮрЛица.Наименование";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат, "Список");
	
КонецПроцедуры

&НаСервере
Процедура ОкНаСервере()
	НаборЗаписей = РегистрыСведений.мАктуальныеВидыРаботЮрЛиц.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Пока НаборЗаписей.Количество() > 0 Цикл
		НаборЗаписей.Удалить(0);
		НаборЗаписей.Записать();
	КонецЦикла;	
	
	Для каждого Стр Из Список Цикл
		Если Стр.Выбран Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Пользователь = Пользователь;
			НоваяЗапись.ВидРаботЮрЛиц = Стр.ВидРабот;
		КонецЕсли; 
	КонецЦикла; 
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ОкНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Пометить(Команда)
	Для каждого Стр Из Список Цикл
		Стр.Выбран = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для каждого Стр Из Список Цикл
		Стр.Выбран = Ложь;
	КонецЦикла; 
КонецПроцедуры
